// 지기지우: KBS 우리말 설명 https://world.kbs.co.kr/service/contents_view.htm?board_seq=347415&id=&lang=k&menu_cate=
export const idiomCorrections = [
  {
    "id": "idiom-토사구팽",
    "word": "토사구팽",
    "oldMeaning": "토끼가 죽으면 사냥개는 잡혀서 삶아진다는 뜻. 목적을 달성하고 나면 그 목적에 이용된 도구 나 사람은 무용하게 되어 배척되거나 제거된다는 의미.",
    "meaning": "토끼가 죽으면 사냥개는 잡혀서 삶아진다는 뜻. 목적을 달성하고 나면 그 목적에 이용된 도구나 사람은 무용하게 되어 배척되거나 제거된다는 의미."
  },
  {
    "id": "idiom-동문서답",
    "word": "동문서답",
    "oldMeaning": "동쪽을 붇는 데 서쪽을 대답한다는 뜻으로, 묻는 말에 대하여 전혀 엉뚱한 대답",
    "meaning": "동쪽을 묻는 데 서쪽을 대답한다는 뜻으로, 묻는 말에 대하여 전혀 엉뚱한 대답"
  },
  {
    "id": "idiom-지기지우",
    "word": "지기지우",
    "oldMeaning": "소리를 알아듣는다는 뜻으로 자기의 속마음을 알아주는 친구를 이르는 말",
    "meaning": "자신의 마음과 뜻을 깊이 이해해 주는 친한 친구"
  },
  {
    "id": "idiom-오매불망",
    "word": "오매불망",
    "oldMeaning": "'자나 깨나 잊지 못하다'라는 뜻으로, 사랑하는 사람을 그리워하여 잠 못 들거나 근심 또는 생 각이 많아 잠 못 드는 것",
    "meaning": "'자나 깨나 잊지 못하다'라는 뜻으로, 사랑하는 사람을 그리워하여 잠 못 들거나 근심 또는 생각이 많아 잠 못 드는 것"
  },
  {
    "id": "idiom-전화위복",
    "word": "전화위복",
    "oldMeaning": "화가 바뀌어 오히려 복이 된다는 뜻으로, 어떤 불행한 일이라도 끊임없는 노력과 강인한 의지 로 힘쓰면 불행을 행복으로 바꾸어 놓을 수 있다는 말",
    "meaning": "화가 바뀌어 오히려 복이 된다는 뜻으로, 어떤 불행한 일이라도 끊임없는 노력과 강인한 의지로 힘쓰면 불행을 행복으로 바꾸어 놓을 수 있다는 말"
  }
];
